"""Εκφώνηση
Γράψτε ένα πρόγραμμα το οποίο θα δέχεται από την εισοδό δύο ακέραιους και έπειτα θα ελέγχει αν ισχύει
κάποιος τελεστής μεταξύ δύο αριθμών.
--π.χ. για το ίσον
...
if x==y
    print(str(x) + "==" + str(y))
...

-- Το πρόγραμμα να ενσώματώνει τους σχεσιακούς τελεστές ==,!=,<,>,<=,>=
"""
x = int(input("Δώσε τον 1ο ακέραιο: "))
y = int(input("Δώσε τον 2ο ακέραιο: "))
# --- == ---
if x == y:
    print(str(x) + "==" + str(y))
# --- != ---
if x != y:
    print(str(x) + "!=" +  str(y))
# --- < ---
if x < y:
    print(str(x) + "<" + str(y))
# --- > ---
if x > y:
    print(str(x) + ">" + str(y))
# --- <= ----
if x <= y:
    print(str(x) + "<=" + str(y))
# --- >= ----
if x >= y:
    print(str(x) + ">=" + str(y))
