# Αποθήκευση κρυμμένου αριθμού, εισαγωγή αριθμού του χρήστη και μύνημα επιτυχίας
# αν τον βρεί σε διαφορετική περίπτωση να ζητά πάλι εισαγωγή αριθμού
#εμφάνιση μυνήματος καθοδήγησης

mystic = int(input("Δωσε το μυστικό αριθμό: ")) + 5
tries = int(input("Πόσες προσπάθειες θέλεις να κανεις: "))
user_mystic = int(input("Γράψε τον κρυμμένο αριθμό: "))
cnt = 1

while cnt <= tries:
    if user_mystic < mystic:
        print("Μικρότερος αριθμός!!!")
        user_mystic = int(input("Δώσε ένα μεγαλύτερο αριθμό: "))
    elif user_mystic > mystic:
        print("Μεγαλύτερος αριθμός!!!")
        user_mystic = int(input("Δώσε ένα μικρότερο αριθμό: "))
    else:
        print("Συγχαρητήρια βρήκες το σωστό αριθμό!!!")
        break
    cnt = cnt + 1

else:
    print("Οι προσπαθειές σου τελείωσαν , έχασες !!!")
